Revit 2024 API
IFCExtrusionBasis Enumeration
 This enumerated type represents the possible bases for derivation of extrusion geometry.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum IFCExtrusionBasis
Visual Basic
Public Enumeration IFCExtrusionBasis
Visual C++
public enum class IFCExtrusionBasis
Members
Member name | Description
InvalidBasis |  An invalid basis (typically indicating that the extrusion extraction was unsuccessful).
BasisX |  The X direction.
BasisY |  The Y direction.
BasisZ |  The Z direction.
See Also
Autodesk.Revit.DB.IFC Namespace